Merge pull request #6 from parradox26/dev
added updated docs
